wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_timer.c
    /* configure the counter direction and aligned mode */
    if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER19 == timer_periph) || \
            (TIMER1  == timer_periph) || (TIMER2  == timer_periph) || (TIMER3  == timer_periph) || (TIMER4  == timer_periph)) {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->alignedmode & ALIGNEDMODE_MASK);
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->counterdirection & COUNTERDIRECTION_MASK);
    }

    /* configure the auto reload value */
    TIMER_CAR(timer_periph) = (uint32_t)(initpara->period);

    /* configure the clock division value */
    if((TIMER5 != timer_periph) && (TIMER6 != timer_periph)) {
        /* reset the CKDIV bit */
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CKDIV);
        TIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clockdivision & CLOCKDIVISION_MASK);
    }

    if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER19 == timer_periph) || \
            (TIMER14 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {
        /* configure the repetition counter value */
        if(initpara->repetitioncounter <= 255U) {
            TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CREPSEL);
            TIMER_CREP0(timer_periph) = (uint32_t)initpara->repetitioncounter;
        } else {
            TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CREPSEL;
            TIMER_CREP1(timer_periph) = (uint32_t)initpara->repetitioncounter;
        }
    }

    /* generate an update event */
    TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
}

/*!
    \brief      enable a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_CEN;
}

/*!
    \brief      disable a TIMER
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_CEN);
}

/*!
    \brief      enable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_ARSE;
}

/*!
    \brief      disable the auto reload shadow function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_auto_reload_shadow_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ARSE);
}

/*!
    \brief      enable the update event
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_update_event_enable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPDIS);
}

/*!
    \brief      disable the update event
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_update_event_disable(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t) TIMER_CTL0_UPDIS;
}

/*!
    \brief      set TIMER counter alignment mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  aligned: center-aligned mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_COUNTER_EDGE: edge-aligned mode
      \arg        TIMER_COUNTER_CENTER_DOWN: center-aligned and counting down assert mode
      \arg        TIMER_COUNTER_CENTER_UP: center-aligned and counting up assert mode
      \arg        TIMER_COUNTER_CENTER_BOTH: center-aligned and counting up/down assert mode
    \param[out] none
    \retval     none
*/
void timer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
    TIMER_CTL0(timer_periph) &= (uint32_t)(~TIMER_CTL0_CAM);
    TIMER_CTL0(timer_periph) |= (uint32_t)aligned;
}

/*!
    \brief      set TIMER counter up direction
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     none
*/
void timer_counter_up_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_DIR);
}

/*!
    \brief      set TIMER counter down direction
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     none
*/
void timer_counter_down_direction(uint32_t timer_periph)
{
    TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_DIR;
}

/*!
    \brief      configure the TIMER adjustment mode function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_adjustment_mode_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL0(timer_periph) |= TIMER_CTL0_ADMEN;
    } else {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_ADMEN);
    }
}

/*!
    \brief      configure TIMER prescaler
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  prescaler: prescaler value, 0~0xFFFF
    \param[in]  pscreload: prescaler reload mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_PSC_RELOAD_NOW: the prescaler is loaded right now
      \arg        TIMER_PSC_RELOAD_UPDATE: the prescaler is loaded at the next update event
    \param[out] none
    \retval     none
*/
void timer_prescaler_config(uint32_t timer_periph, uint16_t prescaler, uint32_t pscreload)
{
    TIMER_PSC(timer_periph) = (uint32_t)prescaler;

    if(TIMER_PSC_RELOAD_NOW == pscreload) {
        TIMER_SWEVG(timer_periph) |= (uint32_t)TIMER_SWEVG_UPG;
    }
}

/*!
    \brief      configure TIMER repetition register value
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  ccsel: repetition register selection
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CREP0_ENABLE: The update event rate is depended to TIMERx_CREP0 register
      \arg        TIMER_CREP1_ENABLE: The update event rate is depended to TIMERx_CREP1 register
    \param[in]  repetition: the counter repetition value, 0~0xFF, use TIMER_CREP0 register
                                                          0~0xFFFFFFFF, use TIMER_CREP1 register
    \param[out] none
    \retval     none
*/
void timer_repetition_value_config(uint32_t timer_periph, uint16_t ccsel, uint32_t repetition)
{
    if(TIMER_CREP0_ENABLE == ccsel) {
        TIMER_CFG(timer_periph) &= (~(uint32_t)TIMER_CFG_CREPSEL);
        TIMER_CREP0(timer_periph) = (uint32_t)repetition;
    } else if(TIMER_CREP1_ENABLE == ccsel) {
        TIMER_CFG(timer_periph) |= (uint32_t)TIMER_CFG_CREPSEL;
        TIMER_CREP1(timer_periph) = (uint32_t)repetition;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      read TIMER runtime repetition register value
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[out] none
    \retval     counter repetition value in TIMER_CREP1 register, 0~0xFFFFFFFF
*/
uint32_t timer_runtime_repetition_value_read(uint32_t timer_periph)
{
    return (TIMER_CREP1(timer_periph));
}

/*!
    \brief      configure TIMER auto reload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  autoreload: the integer part of auto-reload value, 0~0xFFFF(adjustment mode disable, TIMERx(x=0,2,3,5~7,14~16,19))
                                                                   0~0xFFFE(adjustment mode enable, TIMERx(x=0,2,3,5~7,14~16,19))
                                                                   0~0xFFFFFFFF(adjustment mode disable, TIMERx(x=1,4))
                                                                   0~0xFFFFFFE(adjustment mode enable, TIMERx(x=1,4))
    \param[out] none
    \retval     none
*/
void timer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload)
{
    uint32_t reg;

    /* configure auto reload register with adjustment mode enable */
    if(TIMER_CTL0(timer_periph) & TIMER_CTL0_ADMEN) {
        reg = TIMER_CAR(timer_periph);
        reg &= (uint32_t)TIMER_CAR_CARL_FRACT;
        reg |= (uint32_t)autoreload;
        TIMER_CAR(timer_periph) = reg;
    } else {
        /* configure auto reload register with adjustment mode disable */
        TIMER_CAR(timer_periph) = (uint32_t)autoreload;
    }
}

/*!
    \brief      configure TIMER fractional part of auto reload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  fract: fractional part of auto reload value, 0~F
    \param[out] none
    \retval     none
*/
void timer_auto_reload_fract_value_config(uint32_t timer_periph, uint32_t fract)
{
    uint32_t reg;

    reg = TIMER_CAR(timer_periph);
    reg &= (~(uint32_t)TIMER_CAR_CARL_FRACT);
    reg |= (uint32_t)(fract << 28U);
    TIMER_CAR(timer_periph) = reg;
}

/*!
    \brief      get TIMER auto reload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     the integer part of auto reload register value, 0~0xFFFF(adjustment mode disable, TIMERx(x=0,2,3,5~7,14~16,19))
                                                                0~0xFFFE(adjustment mode enable, TIMERx(x=0,2,3,5~7,14~16,19))
                                                                0~0xFFFFFFFF(adjustment mode disable, TIMERx(x=1,4))
                                                                0~0xFFFFFFE(adjustment mode enable, TIMERx(x=1,4))
*/
uint32_t timer_autoreload_value_read(uint32_t timer_periph)
{
    uint32_t autoreload = 0U;

    if(TIMER_CTL0(timer_periph) & TIMER_CTL0_ADMEN) {
        autoreload =  TIMER_CAR(timer_periph) & (~TIMER_CAR_CARL_FRACT);
    } else {
        autoreload =  TIMER_CAR(timer_periph);
    }

    return autoreload;
}

/*!
    \brief      read TIMER fractional part of auto reload register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     fractional part of auto reload value, 0~F
*/
uint32_t timer_auto_reload_fract_value_read(uint32_t timer_periph)
{
    uint32_t fract;

    fract = (TIMER_CAR(timer_periph) & TIMER_CAR_CARL_FRACT) >> 28U;

    return fract;
}

/*!
    \brief      configure TIMER counter register value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  counter: the counter value, 0~0xFFFF, TIMERx(x=0,2,3,5~7,14~16,19)
                                            0~0xFFFFFFFF, TIMERx(x=1,4)
    \param[out] none
    \retval     none
*/
void timer_counter_value_config(uint32_t timer_periph, uint32_t counter)
{
    if(TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN) {
        counter &= (~TIMER_CNT_UPIFBU_MASK);
    }
    TIMER_CNT(timer_periph) = (uint32_t)counter;
}

/*!
    \brief      read TIMER counter value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     counter value: 0~0xFFFF, TIMERx(x=0,2,3,5~7,14~16,19)
                               0~0xFFFFFFFF, TIMERx(x=1,4)
*/
uint32_t timer_counter_read(uint32_t timer_periph)
{
    uint32_t count_value = 0U;

    count_value = (uint32_t)TIMER_CNT(timer_periph);
    if((TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN)) {
        count_value &= (uint32_t)(~TIMER_CNT_UPIFBU_MASK);
    }

    return (count_value);
}

/*!
    \brief      read TIMER prescaler value
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     prescaler register value, 0~0xFFFF
*/
uint16_t timer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
    prescaler_value = (uint16_t)(TIMER_PSC(timer_periph));
    return (prescaler_value);
}

/*!
    \brief      configure TIMER single pulse mode
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  spmode: single pulse mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SP_MODE_SINGLE: single pulse mode
      \arg        TIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void timer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode)
{
    if(TIMER_SP_MODE_SINGLE == spmode) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_SPM;
    } else if(TIMER_SP_MODE_REPETITIVE == spmode) {
        TIMER_CTL0(timer_periph) &= (~((uint32_t)TIMER_CTL0_SPM));
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure timer delayable single pulse mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14,19))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19))
    \param[in]  dspmode: delayable SPM mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_DSPM0: delayable SPM mode 0
      \arg        TIMER_OC_MODE_DSPM1: delayable SPM mode 1
    \param[in]  cnt_dir: counter direction selection
                only one parameter can be selected which is shown as below:
                  TIMER_COUNTER_UP: count up
                  TIMER_COUNTER_DOWN: count down
    \param[out] none
    \retval     none
*/
void timer_delayable_single_pulse_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t dspmode, uint16_t cnt_dir)
{
    /* timer run in single mode*/
    timer_single_pulse_mode_config(timer_periph, TIMER_SP_MODE_SINGLE);
    /* set the CHxCOMCTL/MCHxCOMCTL bits */
    timer_channel_output_mode_config(timer_periph, channel, dspmode);
    /* set the restart + event slave mode */
    timer_slave_mode_select(timer_periph, TIMER_SLAVE_MODE_RESTART_EVENT);
    /* set the counter direction in edge-aligned mode*/
    TIMER_CTL0(timer_periph) &= (~(uint32_t)(TIMER_CTL0_DIR | TIMER_CTL0_CAM));
    TIMER_CTL0(timer_periph) |= (uint32_t)(cnt_dir & COUNTERDIRECTION_MASK);

