wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_timer.c
    /* set the CHxCV/MCHxCV */
    if(TIMER_COUNTER_UP == cnt_dir) {
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CH0CV(timer_periph) = 0U;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CH1CV(timer_periph) = 0U;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CH2CV(timer_periph) = 0U;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CH3CV(timer_periph) = 0U;
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCH0CV(timer_periph) = 0U;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCH1CV(timer_periph) = 0U;
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCH2CV(timer_periph) = 0U;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCH3CV(timer_periph) = 0U;
            break;
        default:
            break;
        }
    } else if(TIMER_COUNTER_DOWN == cnt_dir) {
        /* read the CAR value */
        uint32_t value = timer_autoreload_value_read(timer_periph);
        switch(channel) {
        /* configure TIMER_CH_0 */
        case TIMER_CH_0:
            TIMER_CH0CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_CH_1 */
        case TIMER_CH_1:
            TIMER_CH1CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_CH_2 */
        case TIMER_CH_2:
            TIMER_CH2CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_CH_3 */
        case TIMER_CH_3:
            TIMER_CH3CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_0 */
        case TIMER_MCH_0:
            TIMER_MCH0CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_1 */
        case TIMER_MCH_1:
            TIMER_MCH1CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_2 */
        case TIMER_MCH_2:
            TIMER_MCH2CV(timer_periph) = (uint32_t)value;
            break;
        /* configure TIMER_MCH_3 */
        case TIMER_MCH_3:
            TIMER_MCH3CV(timer_periph) = (uint32_t)value;
            break;
        default:
            break;
        }
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure TIMER update source
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  update: update source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATE_SRC_GLOBAL: update generate by setting of UPG bit or the counter overflow/underflow,
                                           or the slave mode controller trigger
      \arg        TIMER_UPDATE_SRC_REGULAR: update generate only by counter overflow/underflow
    \param[out] none
    \retval     none
*/
void timer_update_source_config(uint32_t timer_periph, uint32_t update)
{
    if(TIMER_UPDATE_SRC_REGULAR == update) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPS;
    } else if(TIMER_UPDATE_SRC_GLOBAL == update) {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPS);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure timer OCPRE_CLR_INT source
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  clear_source: OCPRE_CLR_INT source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OCPRE_CLR_INT_OCPRE_CLR: OCPRE_CLR_INT is connected to the OCPRE_CLR input
      \arg        TIMER_OCPRE_CLR_INT_ETIF: OCPRE_CLR_INT is connected to ETIF
    \param[out] none
    \retval     none
*/
void timer_ocpre_clear_source_config(uint32_t timer_periph, uint32_t clear_source)
{
    if(clear_source == TIMER_OCPRE_CLR_INT_ETIF) {
        TIMER_SMCFG(timer_periph) |= (uint32_t)TIMER_SMCFG_OCRC;
    } else {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_OCRC);
    }
}

/*!
    \brief      configure timer OCPRE_CLR input
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  clear_input: OCPRE_CLR source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OCPRE_CLR_INPUT_0: OCPRE_CLR_INT is connected to OCPRE_CLR 0
      \arg        TIMER_OCPRE_CLR_INPUT_1: OCPRE_CLR_INT is connected to OCPRE_CLR 1
      \arg        TIMER_OCPRE_CLR_INPUT_2: OCPRE_CLR_INT is connected to OCPRE_CLR 2
      \arg        TIMER_OCPRE_CLR_INPUT_3: OCPRE_CLR_INT is connected to OCPRE_CLR 3
      \arg        TIMER_OCPRE_CLR_INPUT_4: OCPRE_CLR_INT is connected to OCPRE_CLR 4
      \arg        TIMER_OCPRE_CLR_INPUT_5: OCPRE_CLR_INT is connected to OCPRE_CLR 5
      \arg        TIMER_OCPRE_CLR_INPUT_6: OCPRE_CLR_INT is connected to OCPRE_CLR 6
      \arg        TIMER_OCPRE_CLR_INPUT_7: OCPRE_CLR_INT is connected to OCPRE_CLR 7
    \param[out] none
    \retval     none
*/
void timer_ocpre_clear_input_config(uint32_t timer_periph, uint32_t clear_input)
{
    TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_AFCTL1_OCRINSEL);
    TIMER_AFCTL1(timer_periph) |= (uint32_t)clear_input;
}

/*!
    \brief      configure the TIMER pulse on compare function
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  pulse_width: 0~255
    \param[in]  pulse_prescaler: 0~7
    \param[out] none
    \retval     none
*/
void timer_pulse_on_compare_config(uint32_t timer_periph, uint32_t pulse_width, uint32_t pulse_prescaler)
{
    TIMER_DECCTL(timer_periph) &= (~(uint32_t)(TIMER_DECCTL_OPWID | TIMER_DECCTL_OPPSC));
    TIMER_DECCTL(timer_periph) |= ((uint32_t)((pulse_width << 16U) | (pulse_prescaler << 24U)));
}

/*!
    \brief      enable the TIMER DMA
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  dma: specify which DMA to enable
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD:  update DMA request, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_DMA_CH0D: channel 0 DMA request, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0~4,7,19)
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0~4,7,19)
      \arg        TIMER_DMA_CMTD: channel commutation DMA request, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_DMA_TRGD: trigger DMA request, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_DMA_MCH1D: multi mode channel 1 DMA request, TIMERx(x=0,7,19)
      \arg        TIMER_DMA_MCH2D: multi mode channel 2 DMA request, TIMERx(x=0,7,19)
      \arg        TIMER_DMA_MCH3D: multi mode channel 3 DMA request, TIMERx(x=0,7,19)
    \param[out] none
    \retval     none
*/
void timer_dma_enable(uint32_t timer_periph, uint32_t dma)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t) dma;
}

/*!
    \brief      disable the TIMER DMA
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  dma: specify which DMA to enable
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_DMA_UPD:  update DMA request, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_DMA_CH0D: channel 0 DMA request, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_DMA_CH1D: channel 1 DMA request, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_DMA_CH2D: channel 2 DMA request, TIMERx(x=0~4,7,19)
      \arg        TIMER_DMA_CH3D: channel 3 DMA request, TIMERx(x=0~4,7,19)
      \arg        TIMER_DMA_CMTD: channel commutation DMA request, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_DMA_TRGD: trigger DMA request, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_DMA_MCH0D: multi mode channel 0 DMA request, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_DMA_MCH1D: multi mode channel 1 DMA request, TIMERx(x=0,7,19)
      \arg        TIMER_DMA_MCH2D: multi mode channel 2 DMA request, TIMERx(x=0,7,19)
      \arg        TIMER_DMA_MCH3D: multi mode channel 3 DMA request, TIMERx(x=0,7,19)
    \param[out] none
    \retval     none
*/
void timer_dma_disable(uint32_t timer_periph, uint32_t dma)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(dma));
}

/*!
    \brief      channel DMA request source selection
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  dma_request: channel DMA request source selection
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMAREQUEST_CHANNELEVENT: DMA request of channel n is sent when channel n event occurs
       \arg        TIMER_DMAREQUEST_UPDATEEVENT: DMA request of channel n is sent when update event occurs
    \param[out] none
    \retval     none
*/
void timer_channel_dma_request_source_select(uint32_t timer_periph, uint32_t dma_request)
{
    if(TIMER_DMAREQUEST_UPDATEEVENT == dma_request) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_DMAS;
    } else if(TIMER_DMAREQUEST_CHANNELEVENT == dma_request) {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_DMAS);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      configure the TIMER DMA transfer
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  dma_baseaddr: DMA access base address
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATA_CTL0: DMA transfer address is TIMER_CTL0, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CTL1: DMA transfer address is TIMER_CTL1, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_SMCFG: DMA transfer address is TIMER_SMCFG, TIMERx(x=0~4,7,14,19)
       \arg        TIMER_DMACFG_DMATA_DMAINTEN: DMA transfer address is TIMER_DMAINTEN, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_INTF: DMA transfer address is TIMER_INTF, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_SWEVG: DMA transfer address is TIMER_SWEVG, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CHCTL0: DMA transfer address is TIMER_CHCTL0, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CHCTL1: DMA transfer address is TIMER_CHCTL1, TIMERx(x=0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CHCTL2: DMA transfer address is TIMER_CHCTL2, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CNT: DMA transfer address is TIMER_CNT, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_PSC: DMA transfer address is TIMER_PSC, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CAR: DMA transfer address is TIMER_CAR, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CREP0: DMA transfer address is TIMER_CREP0, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CH0CV: DMA transfer address is TIMER_CH0CV, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CH1CV: DMA transfer address is TIMER_CH1CV, TIMERx(x=0~4,7,14,19)
       \arg        TIMER_DMACFG_DMATA_CH2CV: DMA transfer address is TIMER_CH2CV, TIMERx(x=0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CH3CV: DMA transfer address is TIMER_CH3CV, TIMERx(x=0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CCHP0: DMA transfer address is TIMER_CCHP0, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_MCHCTL0: DMA transfer address is TIMER_MCHCTL0, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_MCHCTL1: DMA transfer address is TIMER_MCHCTL1, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_MCHCTL2: DMA transfer address is TIMER_MCHCTL2, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_MCH0CV: DMA transfer address is TIMER_MCH0CV, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_MCH1CV: DMA transfer address is TIMER_MCH1CV, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_MCH2CV: DMA transfer address is TIMER_MCH2CV, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_MCH3CV: DMA transfer address is TIMER_MCH3CV, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_CH0COMV_ADD: DMA transfer address is TIMER_CH0COMV_ADD, TIMERx(x=0~4,7,14,19)
       \arg        TIMER_DMACFG_DMATA_CH1COMV_ADD: DMA transfer address is TIMER_CH1COMV_ADD, TIMERx(x=0~4,7,14,19)
       \arg        TIMER_DMACFG_DMATA_CH2COMV_ADD: DMA transfer address is TIMER_CH2COMV_ADD, TIMERx(x=0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CH3COMV_ADD: DMA transfer address is TIMER_CH3COMV_ADD, TIMERx(x=0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CTL2: DMA transfer address is TIMER_CTL2, TIMERx(x=0~4,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_FCCHP0: DMA transfer address is TIMER_FCCHP0, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_FCCHP1: DMA transfer address is TIMER_FCCHP1, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_FCCHP2: DMA transfer address is TIMER_FCCHP2, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_FCCHP3: DMA transfer address is TIMER_FCCHP3, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_AFCTL0: DMA transfer address is TIMER_AFCTL0, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_AFCTL1: DMA transfer address is TIMER_AFCTL1, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_WDGPER: DMA transfer address is TIMER_WDGPER, TIMERx(x=0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CREP1: DMA transfer address is TIMER_CREP1, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_CCHP1: DMA transfer address is TIMER_CCHP1, TIMERx(x=0,7,14~16,19)
       \arg        TIMER_DMACFG_DMATA_DECCTL: DMA transfer address is TIMER_DECCTL, TIMERx(0~4,7,19)
       \arg        TIMER_DMACFG_DMATA_CINITCTL: DMA transfer address is TIMER_CINITCTL, TIMERx(x=0,7,19)
       \arg        TIMER_DMACFG_DMATA_CINITV: DMA transfer address is TIMER_CINITV, TIMERx(x=0,7,19)
    \param[in]  dma_lenth:
                only one parameter can be selected which is shown as below:
       \arg        TIMER_DMACFG_DMATC_xTRANSFER(x=1~42): DMA transfer x time
    \param[out] none
    \retval     none
*/
void timer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth)
{
    TIMER_DMACFG(timer_periph) &= (~(uint32_t)(TIMER_DMACFG_DMATA | TIMER_DMACFG_DMATC));
    TIMER_DMACFG(timer_periph) |= (uint32_t)(dma_baseaddr | dma_lenth);
}

/*!
    \brief      software generate events
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  event: the timer software event generation sources
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_EVENT_SRC_UPG: update event generation, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_EVENT_SRC_CH0G: channel 0 capture or compare event generation, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_EVENT_SRC_CH1G: channel 1 capture or compare event generation, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_EVENT_SRC_CH2G: channel 2 capture or compare event generation, TIMERx(x=0~4,7,19)
      \arg        TIMER_EVENT_SRC_CH3G: channel 3 capture or compare event generation, TIMERx(x=0~4,7,19)
      \arg        TIMER_EVENT_SRC_CMTG: channel commutation event generation, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_EVENT_SRC_TRGG: trigger event generation, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_EVENT_SRC_BRK0G: BREAK0 event generation, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_EVENT_SRC_BRK1G: BREAK1 event generation, TIMERx(x=0,7,19)
      \arg        TIMER_EVENT_SRC_MCH0G: multi mode channel 0 capture or compare event generation, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_EVENT_SRC_MCH1G: multi mode channel 1 capture or compare event generation, TIMERx(x=0,7,19)
      \arg        TIMER_EVENT_SRC_MCH2G: multi mode channel 2 capture or compare event generation, TIMERx(x=0,7,19)
      \arg        TIMER_EVENT_SRC_MCH3G: multi mode channel 3 capture or compare event generation, TIMERx(x=0,7,19)
      \arg        TIMER_EVENT_SRC_CH0COMADDG: channel 0 additional compare event generation, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_EVENT_SRC_CH1COMADDG: channel 1 additional compare event generation, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_EVENT_SRC_CH2COMADDG: channel 2 additional compare event generation, TIMERx(x=0~4,7,19)
      \arg        TIMER_EVENT_SRC_CH3COMADDG: channel 3 additional compare event generation, TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     none
*/
void timer_event_software_generate(uint32_t timer_periph, uint32_t event)
{
    TIMER_SWEVG(timer_periph) |= (uint32_t)event;
}

/*!
    \brief      initialize TIMER break parameter struct with a default value
    \param[in]  breakpara: TIMER break parameter struct
    \param[out] none
    \retval     none
*/
void timer_break_struct_para_init(timer_break_parameter_struct *breakpara)
{
    /* initialize the break parameter struct member with the default value */
    breakpara->runoffstate           = TIMER_ROS_STATE_DISABLE;
    breakpara->ideloffstate          = TIMER_IOS_STATE_DISABLE;
    breakpara->deadtime              = 0U;
    breakpara->outputautostate       = TIMER_OUTAUTO_DISABLE;
    breakpara->protectmode           = TIMER_CCHP0_PROT_OFF;
    breakpara->break0state           = TIMER_BREAK0_DISABLE;
    breakpara->break0filter          = 0U;
    breakpara->break0polarity        = TIMER_BREAK0_POLARITY_LOW;
    breakpara->break0lock            = TIMER_BREAK0_LK_DISABLE;
    breakpara->break0release         = TIMER_BREAK0_UNRELEASE;
    breakpara->break1state           = TIMER_BREAK1_DISABLE;
    breakpara->break1filter          = 0U;
    breakpara->break1polarity        = TIMER_BREAK1_POLARITY_LOW;
    breakpara->break1lock            = TIMER_BREAK1_LK_DISABLE;
    breakpara->break1release         = TIMER_BREAK1_UNRELEASE;
}

/*!
    \brief      configure TIMER break function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  breakpara: TIMER break parameter struct
                  runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                  ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                  deadtime: 0~255
                  outputautostate: TIMER_OUTAUTO_ENABLE, TIMER_OUTAUTO_DISABLE
                  protectmode: TIMER_CCHP0_PROT_OFF, TIMER_CCHP0_PROT_0, TIMER_CCHP0_PROT_1, TIMER_CCHP0_PROT_2
                  break0state: TIMER_BREAK0_ENABLE, TIMER_BREAK0_DISABLE
                  break0filter: 0~15
                  break0polarity: TIMER_BREAK0_POLARITY_LOW, TIMER_BREAK0_POLARITY_HIGH
                  break0lock: TIMER_BREAK0_LK_ENABLE, TIMER_BREAK0_LK_DISABLE
                  break0release: TIMER_BREAK0_RELEASE, TIMER_BREAK0_UNRELEASE
                  break1state: TIMER_BREAK1_ENABLE, TIMER_BREAK1_DISABLE
                  break1filter: 0~15
                  break1polarity: TIMER_BREAK1_POLARITY_LOW, TIMER_BREAK1_POLARITY_HIGH
                  break1lock: TIMER_BREAK1_LK_ENABLE, TIMER_BREAK1_LK_DISABLE
                  break1release: TIMER_BREAK1_RELEASE, TIMER_BREAK1_UNRELEASE
    \param[out] none
    \retval     none
*/
void timer_break_config(uint32_t timer_periph, timer_break_parameter_struct *breakpara)
{
    if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER19 == timer_periph)) {
        TIMER_CCHP0(timer_periph) = (uint32_t)(((uint32_t)(breakpara->runoffstate)) |
                                               ((uint32_t)(breakpara->ideloffstate)) |
                                               ((uint32_t)(breakpara->deadtime)) |
                                               ((uint32_t)(breakpara->outputautostate)) |
                                               ((uint32_t)(breakpara->protectmode)) |
                                               ((uint32_t)(breakpara->break0state)) |
                                               ((uint32_t)(breakpara->break0filter) << 16) |
                                               ((uint32_t)(breakpara->break0polarity)) |
                                               ((uint32_t)(breakpara->break0lock)) |
                                               ((uint32_t)(breakpara->break0release)) |
                                               ((uint32_t)(breakpara->break1state)) |
                                               ((uint32_t)(breakpara->break1filter) << 20) |
                                               ((uint32_t)(breakpara->break1polarity)) |
                                               ((uint32_t)(breakpara->break1lock)) |
                                               ((uint32_t)(breakpara->break1release)));
    } else if((TIMER14 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {
        TIMER_CCHP0(timer_periph) = (uint32_t)(((uint32_t)(breakpara->runoffstate)) |
                                               ((uint32_t)(breakpara->ideloffstate)) |
                                               ((uint32_t)(breakpara->deadtime)) |
                                               ((uint32_t)(breakpara->outputautostate)) |
                                               ((uint32_t)(breakpara->protectmode)) |
                                               ((uint32_t)(breakpara->break0state)) |
                                               ((uint32_t)(breakpara->break0filter) << 16) |
                                               ((uint32_t)(breakpara->break0polarity)) |
                                               ((uint32_t)(breakpara->break0lock)) |
                                               ((uint32_t)(breakpara->break0release)));
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable TIMER break function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0,7,19)
    \param[out] none
    \retval     none
*/
void timer_break_enable(uint32_t timer_periph, uint16_t break_num)
{
    if(TIMER_BREAK0 == break_num) {
        TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRK0EN;
    } else if(TIMER_BREAK1 == break_num) {
        TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRK1EN;
    } else {
    }
}

/*!
    \brief      disable TIMER break function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0,7,19)
    \param[out] none
    \retval     none
*/
void timer_break_disable(uint32_t timer_periph, uint16_t break_num)
{
    if(TIMER_BREAK0 == break_num) {
        TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRK0EN);
    } else if(TIMER_BREAK1 == break_num) {
        TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRK1EN);
    } else {
    }
}

/*!
    \brief      enable TIMER output automatic function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_enable(uint32_t timer_periph)
{
    TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_OAEN;
}

/*!
    \brief      disable TIMER output automatic function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[out] none
    \retval     none
*/
void timer_automatic_output_disable(uint32_t timer_periph)
{
    TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_OAEN);
}

