wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_timer.c
/*!
    \brief      configure TIMER primary output function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_primary_output_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_POEN;
    } else {
        TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_POEN);
    }
}

/*!
    \brief      configure channel commutation control shadow register
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL1(timer_periph) |= (uint32_t)TIMER_CTL1_CCSE;
    } else {
        TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCSE);
    }
}

/*!
    \brief      configure TIMER channel control shadow register update control
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  ccuctl: channel control shadow register update control
                only one parameter can be selected which is shown as below:
      \arg        TIMER_UPDATECTL_CCU: the shadow registers update by when CMTG bit is set
      \arg        TIMER_UPDATECTL_CCUTRI: the shadow registers update by when CMTG bit is set or an rising edge of TRGI occurs
      \arg        TIMER_UPDATECTL_CCUOVER: the shadow registers update by when the overflow event occurs
      \arg        TIMER_UPDATECTL_CCUUNDER: the shadow registers update by when the underflow event occurs
      \arg        TIMER_UPDATECTL_CCUOVERUNDER: the shadow registers update by when the overflow or underflow event occurs
    \param[out] none
    \retval     none
*/
void timer_channel_control_shadow_update_config(uint32_t timer_periph, uint32_t ccuctl)
{
    TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_CCUC);
    TIMER_CTL1(timer_periph) |= (uint32_t)ccuctl;
}

/*!
    \brief      initialize TIMER channel output parameter struct with a default value
    \param[in]  ocpara: TIMER channel n output parameter struct
    \param[out] none
    \retval     none
*/
void timer_channel_output_struct_para_init(timer_oc_parameter_struct *ocpara)
{
    /* initialize the channel output parameter struct member with the default value */
    ocpara->outputstate  = TIMER_CCX_DISABLE;
    ocpara->outputnstate = TIMER_CCXN_DISABLE;
    ocpara->ocpolarity   = TIMER_OC_POLARITY_HIGH;
    ocpara->ocnpolarity  = TIMER_OCN_POLARITY_HIGH;
    ocpara->ocidlestate  = TIMER_OC_IDLE_STATE_LOW;
    ocpara->ocnidlestate = TIMER_OCN_IDLE_STATE_LOW;
}

/*!
    \brief      configure TIMER channel output function
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[in]  ocpara: TIMER channel output parameter struct
                  outputstate: TIMER_CCX_ENABLE, TIMER_CCX_DISABLE
                  outputnstate: TIMER_CCXN_ENABLE, TIMER_CCXN_DISABLE
                  ocpolarity: TIMER_OC_POLARITY_HIGH, TIMER_OC_POLARITY_LOW
                  ocnpolarity: TIMER_OCN_POLARITY_HIGH, TIMER_OCN_POLARITY_LOW
                  ocidlestate: TIMER_OC_IDLE_STATE_LOW, TIMER_OC_IDLE_STATE_HIGH
                  ocnidlestate: TIMER_OCN_IDLE_STATE_LOW, TIMER_OCN_IDLE_STATE_HIGH
    \param[out] none
    \retval     none
*/
void timer_channel_output_config(uint32_t timer_periph, uint16_t channel, timer_oc_parameter_struct *ocpara)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        /* reset the CH0EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0EN);
        /* set the CH0EN bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->outputstate;
        /* reset the CH0P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH0P);
        /* set the CH0P bit */
        TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->ocpolarity;

        if((TIMER0  == timer_periph) || (TIMER7  == timer_periph) || (TIMER19 == timer_periph) || \
                (TIMER14 == timer_periph) || (TIMER15 == timer_periph) || (TIMER16 == timer_periph)) {

            /* reset the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0EN);
            /* set the MCH0EN bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->outputnstate;

            /* reset the MCH0P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH0P);
            /* set the MCH0P bit */
            TIMER_CHCTL2(timer_periph) |= (uint32_t)ocpara->ocnpolarity;

            /* reset the ISO0 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0);
            /* set the ISO0 bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)ocpara->ocidlestate;

            /* reset the ISO0N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO0N);
            /* set the ISO0N bit */
            TIMER_CTL1(timer_periph) |= (uint32_t)ocpara->ocnidlestate;
        }
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0MS);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        /* reset the CH1EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1EN);
        /* set the CH1EN bit */
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->outputstate) << 4U);
        /* reset the CH1P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH1P);
        /* set the CH1P bit */
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->ocpolarity) << 4U);

        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER19 == timer_periph)) {
            /* reset the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1EN);
            /* set the MCH1EN bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->outputnstate) << 4U);
            /* reset the MCH1P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH1P);
            /* set the MCH1P bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->ocnpolarity) << 4U);
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocidlestate) << 2U);
            /* reset the ISO1N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1N);
            /* set the ISO1N bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocnidlestate) << 2U);
        }

        if(TIMER14 == timer_periph) {
            /* reset the ISO1 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO1);
            /* set the ISO1 bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocidlestate) << 2U);
        }

        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1MS);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        /* reset the CH2EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2EN);
        /* set the CH2EN bit */
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->outputstate) << 8U);
        /* reset the CH2P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH2P);
        /* set the CH2P bit */
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->ocpolarity) << 8U);

        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER19 == timer_periph)) {
            /* reset the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2EN);
            /* set the MCH2EN bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->outputnstate) << 8U);
            /* reset the MCH2P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH2P);
            /* set the MCH2P bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->ocnpolarity) << 8U);
            /* reset the ISO2 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2);
            /* set the ISO2 bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocidlestate) << 4U);
            /* reset the ISO2N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO2N);
            /* set the ISO2N bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocnidlestate) << 4U);
        }
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2MS);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        /* reset the CH3EN bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3EN);
        /* set the CH3EN bit */
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->outputstate) << 12U);
        /* reset the CH3P bit */
        TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_CH3P);
        /* set the CH3P bit */
        TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->ocpolarity) << 12U);

        if((TIMER0 == timer_periph) || (TIMER7 == timer_periph) || (TIMER19 == timer_periph)) {
            /* reset the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3EN);
            /* set the MCH3EN bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->outputnstate) << 12U);
            /* reset the MCH3P bit */
            TIMER_CHCTL2(timer_periph) &= (~(uint32_t)TIMER_CHCTL2_MCH3P);
            /* set the MCH3P bit */
            TIMER_CHCTL2(timer_periph) |= ((uint32_t)(ocpara->ocnpolarity) << 12U);
            /* reset the ISO3 bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3);
            /* set the ISO3 bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocidlestate) << 6U);
            /* reset the ISO3N bit */
            TIMER_CTL1(timer_periph) &= (~(uint32_t)TIMER_CTL1_ISO3N);
            /* set the ISO3N bit */
            TIMER_CTL1(timer_periph) |= ((uint32_t)(ocpara->ocnidlestate) << 6U);
        }
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3MS);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output compare mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,19))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19))
    \param[in]  ocmode: channel output compare mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_MODE_TIMING: timing mode
      \arg        TIMER_OC_MODE_ACTIVE: active mode
      \arg        TIMER_OC_MODE_INACTIVE: inactive mode
      \arg        TIMER_OC_MODE_TOGGLE: toggle mode
      \arg        TIMER_OC_MODE_LOW: force low mode
      \arg        TIMER_OC_MODE_HIGH: force high mode
      \arg        TIMER_OC_MODE_PWM0: PWM mode 0
      \arg        TIMER_OC_MODE_PWM1: PWM mode 1
      \arg        TIMER_OC_MODE_DSPM0: delayable SPM mode 0
      \arg        TIMER_OC_MODE_DSPM1: delayable SPM mode 1
      \arg        TIMER_OC_MODE_PULSE: pulse on compare(TIMERx(x=0~4,7,19), TIMER_CH_x(x=2~3))
      \arg        TIMER_OC_MODE_DIR: direction bit output(TIMERx(x=0~4,7,19), TIMER_CH_x(x=2~3))
    \param[out] none
    \retval     none
*/
void timer_channel_output_mode_config(uint32_t timer_periph, uint16_t channel, uint32_t ocmode)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMCTL);
        TIMER_CHCTL0(timer_periph) |= ocmode;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMCTL);
        TIMER_CHCTL0(timer_periph) |= ((ocmode) << 8U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMCTL);
        TIMER_CHCTL1(timer_periph) |= ocmode;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMCTL);
        TIMER_CHCTL1(timer_periph) |= ((ocmode) << 8U);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMCTL);
        TIMER_MCHCTL0(timer_periph) |= ocmode;
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMCTL);
        TIMER_MCHCTL0(timer_periph) |= ((ocmode) << 8U);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMCTL);
        TIMER_MCHCTL1(timer_periph) |= ocmode;
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMCTL);
        TIMER_MCHCTL1(timer_periph) |= ((ocmode) << 8U);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output pulse value
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,19))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19))
    \param[in]  pulse: the integer part of channel output pulse value
                  for TIMER_CH_x(x=0~3):
                    0~0xFFFF(adjustment mode disable, TIMERx(x=0,2,3,5~7,14~16,19))
                    0~0xFFFE(adjustment mode enable, TIMERx(x=0,2,3,5~7,14~16,19))
                    0~0xFFFFFFFF(adjustment mode disable, TIMERx(x=1,4))
                    0~0xFFFFFFE(adjustment mode enable, TIMERx(x=1,4))
                  for TIMER_MCH_x(x=0~3):
                    0~0xFFFF(TIMERx(x=0,7,14~16,19))
    \param[out] none
    \retval     none
*/
void timer_channel_output_pulse_value_config(uint32_t timer_periph, uint16_t channel, uint32_t pulse)
{
    uint32_t reg;

    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        reg = TIMER_CH0CV(timer_periph);
        if((TIMER1  == timer_periph) || (TIMER4  == timer_periph)) {
            /* configure channel output value register with adjustment mode enable */
            if(TIMER_CTL0(timer_periph) & TIMER_CTL0_ADMEN) {
                reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL_INTEGER_32);
            } else {
                reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL_32);
            }
        } else {
            reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL);
        }
        reg |= (uint32_t)pulse;
        TIMER_CH0CV(timer_periph) = reg;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        reg = TIMER_CH1CV(timer_periph);
        if((TIMER1  == timer_periph) || (TIMER4  == timer_periph)) {
            /* configure channel output value register with adjustment mode enable */
            if(TIMER_CTL0(timer_periph) & TIMER_CTL0_ADMEN) {
                reg &= (~(uint32_t)TIMER_CH1CV_CH1VAL_INTEGER_32);
            } else {
                reg &= (~(uint32_t)TIMER_CH1CV_CH1VAL_32);
            }
        } else {
            reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL);
        }
        reg |= (uint32_t)pulse;
        TIMER_CH1CV(timer_periph) = reg;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        reg = TIMER_CH2CV(timer_periph);
        if((TIMER1  == timer_periph) || (TIMER4  == timer_periph)) {
            /* configure channel output value register with adjustment mode enable */
            if(TIMER_CTL0(timer_periph) & TIMER_CTL0_ADMEN) {
                reg &= (~(uint32_t)TIMER_CH2CV_CH2VAL_INTEGER_32);
            } else {
                reg &= (~(uint32_t)TIMER_CH2CV_CH2VAL_32);
            }
        } else {
            reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL);
        }
        reg |= (uint32_t)pulse;
        TIMER_CH2CV(timer_periph) = reg;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        reg = TIMER_CH3CV(timer_periph);
        if((TIMER1  == timer_periph) || (TIMER4  == timer_periph)) {
            /* configure channel output value register with adjustment mode enable */
            if(TIMER_CTL0(timer_periph) & TIMER_CTL0_ADMEN) {
                reg &= (~(uint32_t)TIMER_CH3CV_CH3VAL_INTEGER_32);
            } else {
                reg &= (~(uint32_t)TIMER_CH3CV_CH3VAL_32);
            }
        } else {
            reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL);
        }
        reg |= (uint32_t)pulse;
        TIMER_CH3CV(timer_periph) = reg;
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCH0CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCH1CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCH2CV(timer_periph) = (uint32_t)pulse;
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCH3CV(timer_periph) = (uint32_t)pulse;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel fractional part of output pulse value
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[in]  fract: the fractional part of channel output pulse value, 0~15
    \param[out] none
    \retval     none
*/
void timer_channel_output_pulse_fract_value_config(uint32_t timer_periph, uint16_t channel, uint32_t fract)
{
    uint32_t reg;

    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        reg = TIMER_CH0CV(timer_periph);
        reg &= (~(uint32_t)TIMER_CH0CV_CH0VAL_FRACT);
        reg |= (uint32_t)(fract << 28U);
        TIMER_CH0CV(timer_periph) = reg;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        reg = TIMER_CH1CV(timer_periph);
        reg &= (~(uint32_t)TIMER_CH1CV_CH1VAL_FRACT);
        reg |= (uint32_t)(fract << 28U);
        TIMER_CH1CV(timer_periph) = reg;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        reg = TIMER_CH2CV(timer_periph);
        reg &= (~(uint32_t)TIMER_CH2CV_CH2VAL_FRACT);
        reg |= (uint32_t)(fract << 28U);
        TIMER_CH2CV(timer_periph) = reg;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        reg = TIMER_CH3CV(timer_periph);
        reg &= (~(uint32_t)TIMER_CH3CV_CH3VAL_FRACT);
        reg |= (uint32_t)(fract << 28U);
        TIMER_CH3CV(timer_periph) = reg;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel output shadow function
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
      \arg        TIMER_MCH_0: TIMER multi mode channel 0(TIMERx(x=0,7,14~16,19))
      \arg        TIMER_MCH_1: TIMER multi mode channel 1(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_2: TIMER multi mode channel 2(TIMERx(x=0,7,19))
      \arg        TIMER_MCH_3: TIMER multi mode channel 3(TIMERx(x=0,7,19))
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        TIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
      \arg        TIMER_OMC_SHADOW_ENABLE: multi mode channel output compare shadow enable
      \arg        TIMER_OMC_SHADOW_DISABLE: multi mode channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)ocshadow;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMSEN);
        TIMER_CHCTL0(timer_periph) |= ((uint32_t)(ocshadow) << 8U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)ocshadow;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMSEN);
        TIMER_CHCTL1(timer_periph) |= ((uint32_t)(ocshadow) << 8U);
        break;
    /* configure TIMER_MCH_0 */
    case TIMER_MCH_0:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH0COMSEN);
        TIMER_MCHCTL0(timer_periph) |= (uint32_t)ocshadow;
        break;
    /* configure TIMER_MCH_1 */
    case TIMER_MCH_1:
        TIMER_MCHCTL0(timer_periph) &= (~(uint32_t)TIMER_MCHCTL0_MCH1COMSEN);
        TIMER_MCHCTL0(timer_periph) |= ((uint32_t)(ocshadow) << 8U);
        break;
    /* configure TIMER_MCH_2 */
    case TIMER_MCH_2:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH2COMSEN);
        TIMER_MCHCTL1(timer_periph) |= (uint32_t)ocshadow;
        break;
    /* configure TIMER_MCH_3 */
    case TIMER_MCH_3:
        TIMER_MCHCTL1(timer_periph) &= (~(uint32_t)TIMER_MCHCTL1_MCH3COMSEN);
        TIMER_MCHCTL1(timer_periph) |= ((uint32_t)(ocshadow) << 8U);
        break;
    default:
        break;
    }
}

