wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_timer.c
    reg &= (~(uint32_t)((uint32_t)TIMER_MCH_MODE_MASK << (((channel & 0xFU) << 1U) + 20U)));
    reg |= (uint32_t)(multi_mode_sel << (((channel & 0xFU) << 1U) + 20U));

    TIMER_CTL2(timer_periph) = reg;
}

/*!
    \brief      select TIMER input trigger source
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,19)
    \param[in]  intrigger: input trigger source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SMCFG_TRGSEL_ITI0: internal trigger 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI1: internal trigger 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI2: internal trigger 2(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI3: internal trigger 3(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_CI0F_ED: TI0 edge detector(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_CI0FE0: filtered channel 0 input(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_CI1FE1: filtered channel 1 input(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ETIFP: filtered external trigger input(TIMERx(x=0~4,7,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI4: internal trigger 4(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI5: internal trigger 5(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI6: internal trigger 6(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI7: internal trigger 7(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI8: internal trigger 8(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI9: internal trigger 9(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI10: internal trigger 10(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SMCFG_TRGSEL_ITI14: internal trigger 14(TIMERx(x=0~4,7,14,19))
    \param[out] none
    \retval     none
*/
void timer_input_trigger_source_select(uint32_t timer_periph, uint32_t intrigger)
{
    uint8_t timerx_temp = 0U;
    uint32_t timer_base_addr = 0U;
    uint32_t reg_temp;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint32_t j_temp = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

    switch(timer_periph) {
    case TIMER0:
        timerx_temp = SYSCFG_TIMER0;
        break;
    case TIMER1:
        timerx_temp = SYSCFG_TIMER1;
        break;
    case TIMER2:
        timerx_temp = SYSCFG_TIMER2;
        break;
    case TIMER3:
        timerx_temp = SYSCFG_TIMER3;
        break;
    case TIMER4:
        timerx_temp = SYSCFG_TIMER4;
        break;
    case TIMER7:
        timerx_temp = SYSCFG_TIMER7;
        break;
    case TIMER14:
        timerx_temp = SYSCFG_TIMER14;
        break;
    case TIMER19:
        timerx_temp = SYSCFG_TIMER19;
        break;
    default:
        break;
    }

    timer_base_addr = SYSCFG_TIMERCFG(timerx_temp);

    /* read SYSCFG_TIMERCFG0 register value */
    TIMERxCFG0_value = REG32(timer_base_addr) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG1 register value */
    TIMERxCFG1_value = REG32(timer_base_addr + 4U) & 0x7FFF7FFFU;
    /* read SYSCFG_TIMERCFG2 register value */
    TIMERxCFG2_value = REG32(timer_base_addr + 8U) & 0x7FFF7FFFU;

    if((0U == TIMERxCFG0_value) && (0U == TIMERxCFG1_value) && (0U == TIMERxCFG2_value)) {
        REG32(timer_base_addr + 8U) = (uint32_t)(intrigger) << 16U;
    } else {
        for(i = 0U; i < 0x0CU; i += 4U) {
            if((REG32(timer_base_addr + i) & 0x7FFF7FFFU) != 0x00000000U) {
                j = 0U;
                reg_temp = REG32(timer_base_addr + i) & 0x7FFFU;
                if(0U == reg_temp) {
                    j = 16U;
                    reg_temp = (REG32(timer_base_addr + i) & 0x7FFF0000U);
                }
                j_temp = j;
                for(j = j_temp; j < 31U; j += 5U) {
                    if(reg_temp & (0x1FU << j)) {
                        REG32(timer_base_addr + i) = (uint32_t)(intrigger) << j;
                        break;
                    }
                }

                break;
            }
        }
    }
}

/*!
    \brief      select TIMER master mode output 0 trigger source
    \param[in]  timer_periph: TIMERx(x=0~7,14,19)
    \param[in]  outrigger: trigger output 0 source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT0_SRC_RESET: the UPG bit as trigger output 0(TIMERx(x=0~7,14,19))
      \arg        TIMER_TRI_OUT0_SRC_ENABLE: the counter enable signal as trigger output 0(TIMERx(x=0~7,14,19))
      \arg        TIMER_TRI_OUT0_SRC_UPDATE: update event as trigger output 0(TIMERx(x=0~7,14,19))
      \arg        TIMER_TRI_OUT0_SRC_CH0: a capture or a compare match occurred in channel 0 as trigger output 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_TRI_OUT0_SRC_O0CPRE: O0CPRE as trigger output 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_TRI_OUT0_SRC_O1CPRE: O1CPRE as trigger output 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_TRI_OUT0_SRC_O2CPRE: O2CPRE as trigger output 0(TIMERx(x=0~4,7,19))
      \arg        TIMER_TRI_OUT0_SRC_O3CPRE: O3CPRE as trigger output 0(TIMERx(x=0~4,7,19))
      \arg        TIMER_TRI_OUT0_SRC_DECODER_CLOCK: decoder clock as trigger output 0(TIMERx(x=0~4,7,19))
      \arg        TIMER_TRI_OUT0_SRC_SYNC: synchronization event as trigger output 0(TIMERx(x=0,7,19))
    \param[out] none
    \retval     none
*/
void timer_master_output0_trigger_source_select(uint32_t timer_periph, uint32_t outrigger)
{
    uint32_t reg;

    reg  = TIMER_CTL1(timer_periph);
    reg &= (~(uint32_t)TIMER_CTL1_MMC0);
    reg |= (uint32_t)outrigger;
    TIMER_CTL1(timer_periph) = reg;
}

/*!
    \brief      select TIMER master mode output 1 trigger source
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  outrigger: trigger output 1 source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_TRI_OUT1_SRC_RESET: the UPG bit as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_ENABLE: the counter enable signal TIMER_CTL0_CEN as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_UPDATE: update event as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_CH0: a capture or a compare match occurred in channel 0 as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O0CPRE: O0CPRE as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O1CPRE: O1CPRE as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O2CPRE: O2CPRE as trigger output 1
      \arg        TIMER_TRI_OUT1_SRC_O3CPRE: O3CPRE as trigger output 1
    \param[out] none
    \retval     none
*/
void timer_master_output1_trigger_source_select(uint32_t timer_periph, uint32_t outrigger)
{
    uint32_t reg;

    reg  = TIMER_CTL1(timer_periph);
    reg &= (~(uint32_t)TIMER_CTL1_MMC1);
    reg |= (uint32_t)outrigger;
    TIMER_CTL1(timer_periph) = reg;
}

/*!
    \brief      select TIMER slave mode
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,19)
    \param[in]  slavemode: slave mode
                only one parameter can be selected which is shown as below:
      \arg        TIMER_SLAVE_MODE_DISABLE: slave mode disable(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_QUAD_DECODER_MODE0: quadrature decoder mode 0(TIMERx(x=0~4,7,19))
      \arg        TIMER_QUAD_DECODER_MODE1: quadrature decoder mode 1(TIMERx(x=0~4,7,19))
      \arg        TIMER_QUAD_DECODER_MODE2: quadrature decoder mode 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_SLAVE_MODE_RESTART: restart mode(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SLAVE_MODE_PAUSE: pause mode(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SLAVE_MODE_EVENT: event mode(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SLAVE_MODE_EXTERNAL0: external clock mode 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SLAVE_MODE_RESTART_EVENT: restart + event mode(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_SLAVE_MODE_PAUSE_RESTART: pause + restart mode(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_DECODER_MODE0: decoder mode 0(TIMERx(x=0~4,7,19))
      \arg        TIMER_DECODER_MODE1: decoder mode 1(TIMERx(x=0~4,7,19))
      \arg        TIMER_DECODER_MODE2: decoder mode 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_DECODER_MODE3: decoder mode 3(TIMERx(x=0~4,7,19))
      \arg        TIMER_QUAD_DECODER_MODE3: quadrature decoder mode 3(TIMERx(x=0~4,7,19))
      \arg        TIMER_QUAD_DECODER_MODE4: quadrature decoder mode 4(TIMERx(x=0~4,7,19))
    \param[out] none
    \retval     none
*/
void timer_slave_mode_select(uint32_t timer_periph, uint32_t slavemode)
{
    uint32_t timerx_temp = 0U;
    uint32_t timerxcfg_addr = 0U;
    uint32_t timer_base_addr = 0U;
    uint32_t trigger_temp = 0U;
    uint32_t trigger_off = 0U;
    uint32_t reg_temp;
    uint32_t i = 0U;
    uint32_t j = 0U;
    uint32_t TIMERxCFG0_value, TIMERxCFG1_value, TIMERxCFG2_value;

