wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_timer.c
/*!
    \brief      configure the TIMER composite PWM mode output pulse value
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,19))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[in]  pulse: channel compare value, 0~0xFFFFFFFF
    \param[in]  add_pulse: channel additional compare value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_channel_composite_pwm_mode_output_pulse_value_config(uint32_t timer_periph, uint32_t channel, uint32_t pulse, uint32_t add_pulse)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH0COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH1COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH2COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3CV(timer_periph) = (uint32_t)pulse;
        TIMER_CH3COMV_ADD(timer_periph) = (uint32_t)add_pulse;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel additional compare value
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,19))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[in]  value: channel additional compare value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_channel_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint32_t value)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CH0COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CH1COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CH2COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CH3COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure TIMER channel additional output shadow function
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[in]  aocshadow: channel additional output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_SHADOW_ENABLE: channel additional compare output shadow enable
      \arg        TIMER_ADD_SHADOW_DISABLE: channel additional compare output shadow disable
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t aocshadow)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0COMADDSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 28U);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1COMADDSEN);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 29U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2COMADDSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 28U);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3COMADDSEN);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)aocshadow << 29U);
        break;
    default:
        break;
    }
}

/*!
    \brief      select TIMER channel additional output register update source
    \param[in]  timer_periph: TIMERx(x=0~4,7,14~16,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14~16,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[in]  update: channel additional output register update
                only one parameter can be selected which is shown as below:
      \arg        TIMER_ADD_UPDATE_BY_UPDATE: channel additional compare value register update by update event
      \arg        TIMER_ADD_UPDATE_BY_COM_MATCH: channel additional compare value register update by compare value match event
    \param[out] none
    \retval     none
*/
void timer_channel_additional_output_update_select(uint32_t timer_periph, uint16_t channel, uint16_t update)
{
    switch(channel) {
    /* configure TIMER_CH_0 */
    case TIMER_CH_0:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH0ADDUPS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)update << 26U);
        break;
    /* configure TIMER_CH_1 */
    case TIMER_CH_1:
        TIMER_CHCTL0(timer_periph) &= (~(uint32_t)TIMER_CHCTL0_CH1ADDUPS);
        TIMER_CHCTL0(timer_periph) |= (uint32_t)((uint32_t)update << 27U);
        break;
    /* configure TIMER_CH_2 */
    case TIMER_CH_2:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH2ADDUPS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)update << 26U);
        break;
    /* configure TIMER_CH_3 */
    case TIMER_CH_3:
        TIMER_CHCTL1(timer_periph) &= (~(uint32_t)TIMER_CHCTL1_CH3ADDUPS);
        TIMER_CHCTL1(timer_periph) |= (uint32_t)((uint32_t)update << 27U);
        break;
    default:
        break;
    }
}

/*!
    \brief      read TIMER channel additional compare value
    \param[in]  timer_periph: TIMERx(x=0~4,7,14,19))
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_1: TIMER channel 1(TIMERx(x=0~4,7,14,19))
      \arg        TIMER_CH_2: TIMER channel 2(TIMERx(x=0~4,7,19))
      \arg        TIMER_CH_3: TIMER channel 3(TIMERx(x=0~4,7,19))
    \param[out] none
    \retval     value: channel additional compare value, 0~0xFFFFFFFF
*/
uint32_t timer_channel_additional_compare_value_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t value = 0U;
    switch(channel) {
    case TIMER_CH_0:
        /* read CH0COMV_ADD value */
        value = TIMER_CH0COMV_ADD(timer_periph);
        break;
    case TIMER_CH_1:
        /* read CH1COMV_ADD value */
        value = TIMER_CH1COMV_ADD(timer_periph);
        break;
    case TIMER_CH_2:
        /* read CH2COMV_ADD value */
        value = TIMER_CH2COMV_ADD(timer_periph);
        break;
    case TIMER_CH_3:
        /* read CH3COMV_ADD value */
        value = TIMER_CH3COMV_ADD(timer_periph);
        break;
    default:
        break;
    }
    return value;
}

/*!
    \brief      configure the TIMER break source
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signals, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BREAK1: BREAK1 input signals, TIMERx(x=0,7,19)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKIN1: BRKIN1 alternate function input enable, TIMERx(x=0,7,19)
      \arg        TIMER_BRKIN2: BRKIN2 alternate function input enable, TIMERx(x=0,7,19)
      \arg        TIMER_BRKCMP0: CMP0 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP1: CMP1 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP2: CMP2 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP3: CMP3 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP4: CMP4 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP5: CMP5 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP6: CMP6 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP7: CMP7 input enable, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKHPDF: HPDF input enable, TIMERx(x=0,7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_external_source_config(uint32_t timer_periph, uint16_t break_num, uint32_t break_src, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_AFCTL0(timer_periph) |= break_src;
        } else if(TIMER_BREAK1 == break_num) {
            TIMER_AFCTL1(timer_periph) |= break_src;
        } else {
            /* illegal parameters */
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_AFCTL0(timer_periph) &= (~break_src);
        } else if(TIMER_BREAK1 == break_num) {
            TIMER_AFCTL1(timer_periph) &= (~break_src);
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure TIMER break polarity
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: BREAK0 input signal, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BREAK1: BREAK1 input signal, TIMERx(x=0,7,19)
    \param[in]  break_src: break source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BRKIN0: BRKIN0 alternate function input, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKIN1: BRKIN1 alternate function input, TIMERx(x=0,7,19)
      \arg        TIMER_BRKIN2: BRKIN2 alternate function input, TIMERx(x=0,7,19)
      \arg        TIMER_BRKCMP0: CMP0 input, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP1: CMP1 input, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP2: CMP2 input, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BRKCMP3: CMP3 input, TIMERx(x=0,7,14~16,19)
    \param[in]  bkinpolarity: break polarity
                only one parameter can be selected which is shown as below:
                  TIMER_BRKIN_POLARITY_LOW: input signal will not be inverted
                  TIMER_BRKIN_POLARITY_HIGH: input signal will be inverted
    \param[out] none
    \retval     none
*/
void timer_break_external_polarity_config(uint32_t timer_periph, uint16_t break_num, uint32_t break_src, uint16_t bkinpolarity)
{
    if(TIMER_BREAK0 == break_num) {
        switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 16U);
            break;
        case TIMER_BRKIN1:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN1P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 17U);
            break;
        case TIMER_BRKIN2:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKIN2P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 18U);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 25U);
            break;
        case TIMER_BRKCMP1:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP1P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 26U);
            break;
        case TIMER_BRKCMP2:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP2P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 27U);
            break;
        case TIMER_BRKCMP3:
            TIMER_AFCTL0(timer_periph) &= (~(uint32_t)TIMER_BRKCMP3P);
            TIMER_AFCTL0(timer_periph) |= ((uint32_t)bkinpolarity << 28U);
            break;
        default:
            break;
        }
    } else {
        switch(break_src) {
        case TIMER_BRKIN0:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN0P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 16U);
            break;
        case TIMER_BRKIN1:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN1P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 17U);
            break;
        case TIMER_BRKIN2:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKIN2P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 18U);
            break;
        case TIMER_BRKCMP0:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP0P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 25U);
            break;
        case TIMER_BRKCMP1:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP1P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 26U);
            break;
        case TIMER_BRKCMP2:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP2P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 27U);
            break;
        case TIMER_BRKCMP3:
            TIMER_AFCTL1(timer_periph) &= (~(uint32_t)TIMER_BRKCMP3P);
            TIMER_AFCTL1(timer_periph) |= ((uint32_t)bkinpolarity << 28U);
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      configure TIMER break lock function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: enable BREAK0 lock function, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BREAK1: enable BREAK1 lock function, TIMERx(x=0,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_lock_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRK0LK;
        } else {
            TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRK1LK;
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRK0LK);
        } else {
            TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRK1LK);
        }
    }
}

/*!
    \brief      release the TIMER break lock function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  break_num: TIMER BREAKx
                only one parameter can be selected which is shown as below:
      \arg        TIMER_BREAK0: release the BREAK0 lock function, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_BREAK1: release the BREAK1 lock function, TIMERx(x=0,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_break_lock_release_config(uint32_t timer_periph, uint16_t break_num, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRK0REL;
        } else {
            TIMER_CCHP0(timer_periph) |= (uint32_t)TIMER_CCHP0_BRK1REL;
        }
    } else {
        if(TIMER_BREAK0 == break_num) {
            TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRK0REL);
        } else {
            TIMER_CCHP0(timer_periph) &= (~(uint32_t)TIMER_CCHP0_BRK1REL);
        }
    }
}

/*!
    \brief      configure the TIMER falling edge dead time
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  deadtime: 0~255
    \param[out] none
    \retval     none
*/
void timer_dead_time_falling_edge_config(uint32_t timer_periph, uint32_t deadtime)
{
    TIMER_CCHP1(timer_periph) &= (~(uint32_t)TIMER_CCHP1_DTFCFG);
    TIMER_CCHP1(timer_periph) |= (uint32_t)deadtime;
}

/*!
    \brief      configure the TIMER dead time different function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_dead_time_different_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CCHP1(timer_periph) |= (uint32_t)TIMER_CCHP1_DTDIFEN;
    } else {
        TIMER_CCHP1(timer_periph) &= (~(uint32_t)TIMER_CCHP1_DTDIFEN);
    }
}

/*!
    \brief      configure the TIMER dead time modified on-the-fly function
    \param[in]  timer_periph: TIMERx(x=0,7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_dead_time_modify_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CCHP1(timer_periph) |= (uint32_t)TIMER_CCHP1_DTMODEN;
    } else {
        TIMER_CCHP1(timer_periph) &= (~(uint32_t)TIMER_CCHP1_DTMODEN);
    }
}

/*!
    \brief      configure the TIMER channel break function
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_break_control_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_BRKENCH0 << channel);
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_BRKENCH0 << channel));
    }
}

/*!
    \brief      configure the TIMER channel free dead time function
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_channel_dead_time_config(uint32_t timer_periph, uint32_t channel, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= (uint32_t)(TIMER_CTL2_DTIENCH0 << channel);
    } else {
        TIMER_CTL2(timer_periph) &= (~(uint32_t)(TIMER_CTL2_DTIENCH0 << channel));
    }
}

/*!
    \brief      initialize TIMER channel free complementary parameter struct with a default value
    \param[in]  freecompara: TIMER channel free complementary parameter struct
    \param[out] none
    \retval     none
*/
void timer_free_complementary_struct_para_init(timer_free_complementary_parameter_struct *freecompara)
{
    /* initialize the channel free complementary parameter struct member with the default value */
    freecompara->freecomstate    = TIMER_FCCHP_STATE_DISABLE;
    freecompara->runoffstate     = TIMER_ROS_STATE_DISABLE;
    freecompara->ideloffstate    = TIMER_IOS_STATE_DISABLE;
    freecompara->deadtime        = 0U;
    freecompara->fallingdeadtime = 0U;
}

/*!
    \brief      configure channel free complementary protection
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  channel: TIMER channel
                only one parameter can be selected which is shown as below:
      \arg        TIMER_CH_0: TIMER channel 0
      \arg        TIMER_CH_1: TIMER channel 1
      \arg        TIMER_CH_2: TIMER channel 2
      \arg        TIMER_CH_3: TIMER channel 3
    \param[in] fcpara: TIMER channel free complementary parameter struct
                freecomstate: TIMER_FCCHP_STATE_ENABLE, TIMER_FCCHP_STATE_DISABLE
                runoffstate: TIMER_ROS_STATE_ENABLE, TIMER_ROS_STATE_DISABLE
                ideloffstate: TIMER_IOS_STATE_ENABLE, TIMER_IOS_STATE_DISABLE
                deadtime: 0~255
                fallingdeadtime: 0~255
    \param[out] none
    \retval     none
*/
void timer_channel_free_complementary_config(uint32_t timer_periph, uint16_t channel, timer_free_complementary_parameter_struct *fcpara)
{
    switch(channel) {
    case TIMER_CH_0:
        TIMER_FCCHP0(timer_periph) &= (~(uint32_t)(TIMER_FCCHP0_DTCFG | TIMER_FCCHP0_IOS | TIMER_FCCHP0_ROS | TIMER_FCCHP0_DTFCFG | TIMER_FCCHP0_FCCHP0EN));
        TIMER_FCCHP0(timer_periph) |= fcpara->deadtime;
        TIMER_FCCHP0(timer_periph) |= fcpara->ideloffstate;
        TIMER_FCCHP0(timer_periph) |= fcpara->runoffstate;
        TIMER_FCCHP0(timer_periph) |= (fcpara->fallingdeadtime << 16U);
        TIMER_FCCHP0(timer_periph) |= fcpara->freecomstate;
        break;
    case TIMER_CH_1:
        TIMER_FCCHP1(timer_periph) &= (~(uint32_t)(TIMER_FCCHP1_DTCFG | TIMER_FCCHP1_IOS | TIMER_FCCHP1_ROS | TIMER_FCCHP1_DTFCFG | TIMER_FCCHP1_FCCHP1EN));
        TIMER_FCCHP1(timer_periph) |= fcpara->deadtime;
        TIMER_FCCHP1(timer_periph) |= fcpara->ideloffstate;
        TIMER_FCCHP1(timer_periph) |= fcpara->runoffstate;
        TIMER_FCCHP1(timer_periph) |= (fcpara->fallingdeadtime << 16U);
        TIMER_FCCHP1(timer_periph) |= fcpara->freecomstate;
        break;
    case TIMER_CH_2:
        TIMER_FCCHP2(timer_periph) &= (~(uint32_t)(TIMER_FCCHP2_DTCFG | TIMER_FCCHP2_IOS | TIMER_FCCHP2_ROS | TIMER_FCCHP2_DTFCFG | TIMER_FCCHP2_FCCHP2EN));
        TIMER_FCCHP2(timer_periph) |= fcpara->deadtime;
        TIMER_FCCHP2(timer_periph) |= fcpara->ideloffstate;
        TIMER_FCCHP2(timer_periph) |= fcpara->runoffstate;
        TIMER_FCCHP2(timer_periph) |= (fcpara->fallingdeadtime << 16U);
        TIMER_FCCHP2(timer_periph) |= fcpara->freecomstate;
        break;
    case TIMER_CH_3:
        TIMER_FCCHP3(timer_periph) &= (~(uint32_t)(TIMER_FCCHP3_DTCFG | TIMER_FCCHP3_IOS | TIMER_FCCHP3_ROS | TIMER_FCCHP3_DTFCFG | TIMER_FCCHP3_FCCHP3EN));
        TIMER_FCCHP3(timer_periph) |= fcpara->deadtime;
        TIMER_FCCHP3(timer_periph) |= fcpara->ideloffstate;
        TIMER_FCCHP3(timer_periph) |= fcpara->runoffstate;
        TIMER_FCCHP3(timer_periph) |= (fcpara->fallingdeadtime << 16U);
        TIMER_FCCHP3(timer_periph) |= fcpara->freecomstate;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure quadrature decoder signal disconnection detection watchdog value
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  value: watchdog counter period value, 0~0xFFFFFFFF
    \param[out] none
    \retval     none
*/
void timer_watchdog_value_config(uint32_t timer_periph, uint32_t value)
{
    TIMER_WDGPER(timer_periph) = value;
}

