wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Source/gd32g5x3_timer.c
/*!
    \brief      read quadrature decoder signal disconnection detection watchdog value
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     watchdog counter period register value, 0~0xFFFFFFFF
*/
uint32_t timer_watchdog_value_read(uint32_t timer_periph)
{
    return (TIMER_WDGPER(timer_periph));
}

/*!
    \brief      configure quadrature decoder signal disconnection detection function
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_disconnection_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECDISCONNECTDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECDISCONNECTDEN);
    }
}

/*!
    \brief      configure quadrature decoder signal jump detection function
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_jump_detection_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL2(timer_periph) |= TIMER_DECJUMPDEN;
    } else {
        TIMER_CTL2(timer_periph) &= (~TIMER_DECJUMPDEN);
    }
}

/*!
    \brief      configure decoder mode modified on-the-fly function
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_decoder_modify_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_SMCFG(timer_periph) |= ((uint32_t)TIMER_SMCFG_DECMODEN);
    } else {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_DECMODEN);
    }
}

/*!
    \brief      configure decoder mode update source
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  source: update source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_DEC_UPDATE_BY_UPDATE: decoder mode is updated by the update event
      \arg        TIMER_DEC_UPDATE_BY_INDEX: decoder mode is updated by the index event
    \param[out] none
    \retval     none
*/
void timer_decoder_mode_update_source_config(uint32_t timer_periph, uint32_t source)
{
    if(TIMER_DEC_UPDATE_BY_UPDATE == source) {
        TIMER_SMCFG(timer_periph) &= (~(uint32_t)TIMER_SMCFG_DECMODS);
    } else {
        TIMER_SMCFG(timer_periph) |= ((uint32_t)TIMER_SMCFG_DECMODS);
    }
}

/*!
    \brief      configure index signal reset counter function
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_index_reset_counter_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_DECCTL(timer_periph) |= ((uint32_t)TIMER_DECCTL_INDRSTEN);
    } else {
        TIMER_DECCTL(timer_periph) &= (~(uint32_t)TIMER_DECCTL_INDRSTEN);
    }
}

/*!
    \brief      configure index signal reset counter direction
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  direction: index signal reset counter direction
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INDEX_RESET_DIRECTION_BOTH: index signal resets the counter when it counts up and down
      \arg        TIMER_INDEX_RESET_DIRECTION_UP: index signal resets the counter when it counts up
      \arg        TIMER_INDEX_RESET_DIRECTION_DOWN: index signal resets the counter when it counts down
    \param[out] none
    \retval     none
*/
void timer_index_reset_direction_config(uint32_t timer_periph, uint32_t direction)
{
    TIMER_DECCTL(timer_periph) &= (~(uint32_t)TIMER_DECCTL_INDRSTDIR);
    TIMER_DECCTL(timer_periph) |= (uint32_t)(direction);
}

/*!
    \brief      configure index position
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  position: index position
                only one parameter can be selected which is shown as below:
                TIMERx works in quadrature decoder modes 0~4:
      \arg        TIMER_INDEX_POSITION_AB_00: when AB inputs are 00, index event will reset the counter
      \arg        TIMER_INDEX_POSITION_AB_01: when AB inputs are 01, index event will reset the counter
      \arg        TIMER_INDEX_POSITION_AB_10: when AB inputs are 10, index event will reset the counter
      \arg        TIMER_INDEX_POSITION_AB_11: when AB inputs are 11, index event will reset the counter
                TIMERx works in decoder modes 0~3:
      \arg        TIMER_INDEX_POSITION_LOW: when clock is low, index event will reset the counter
      \arg        TIMER_INDEX_POSITION_HIGH: when clock is high, index event will reset the counter
    \param[out] none
    \retval     none
*/
void timer_decoder_index_position_config(uint32_t timer_periph, uint32_t position)
{
    TIMER_DECCTL(timer_periph) &= (~(uint32_t)(TIMER_DECCTL_INDP));
    TIMER_DECCTL(timer_periph) |= (uint32_t)(position);
}

/*!
    \brief      configure only the first index signal reset counter function
    \param[in]  timer_periph: TIMERx(x=0~4,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_first_index_reset_counter_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_DECCTL(timer_periph) |= ((uint32_t)TIMER_DECCTL_FINDRST);
    } else {
        TIMER_DECCTL(timer_periph) &= (~(uint32_t)TIMER_DECCTL_FINDRST);
    }
}

/*!
    \brief      configure the UPIF bit backup function
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_upif_backup_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CTL0(timer_periph) |= (uint32_t)TIMER_CTL0_UPIFBUEN;
    } else {
        TIMER_CTL0(timer_periph) &= (~(uint32_t)TIMER_CTL0_UPIFBUEN);
    }
}

/*!
    \brief      get the UPIFBU bit in the TIMERx_CNT register
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[out] none
    \retval     UPIFBUStatus: VALID_SET or VALID_RESET or INVALID
      \ret        VALID_SET: the UPIFBU is valid and value is 1
      \ret        VALID_RESET: the UPIFBU is valid and value is 0
      \ret        INVALID: the UPIFBU is invalid
*/
UPIFBUStatus timer_upifbu_bit_get(uint32_t timer_periph)
{
    UPIFBUStatus timer_upifbu_bit = INVALID;
    if((TIMER_CTL0(timer_periph) & TIMER_CTL0_UPIFBUEN)) {
        if(TIMER_CNT(timer_periph) & TIMER_CNT_UPIFBU) {
            timer_upifbu_bit = VALID_SET;
        } else {
            timer_upifbu_bit = VALID_RESET;
        }
    } else {
        timer_upifbu_bit = INVALID;
    }
    return timer_upifbu_bit;
}

/*!
    \brief      configure counter initial value register
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void timer_counter_initial_register_config(uint32_t timer_periph, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        TIMER_CINITCTL(timer_periph) |= TIMER_CINITCTL_CINITVEN;
    } else {
        TIMER_CINITCTL(timer_periph) &= (~(uint32_t)TIMER_CINITCTL_CINITVEN);
    }
}

/*!
    \brief      configure counter initial value and direction
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[in]  value: counter initial value, 0~0xFFFF
    \param[in]  direction: counter initial direction
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INITIAL_DIRECTION_DOWN: counter count down when synchronization event occurs
      \arg        TIMER_INITIAL_DIRECTION_UP: counter count up when synchronization event occurs
    \param[out] none
    \retval     none
*/
void timer_counter_initial_config(uint32_t timer_periph, uint32_t value, uint32_t direction)
{
    TIMER_CINITV(timer_periph) = (uint32_t)value;

    TIMER_CINITCTL(timer_periph) &= (~(uint32_t)TIMER_CINITCTL_CINITDIR);
    TIMER_CINITCTL(timer_periph) |= (uint32_t)direction;
}

/*!
    \brief      generate soft synchronization event
    \param[in]  timer_periph: TIMERx(x=0,7,19)
    \param[out] none
    \retval     none
*/
void timer_synchronization_event_generate(uint32_t timer_periph)
{
    TIMER_CINITCTL(timer_periph) |= TIMER_CINITCTL_SWSYNCG;
}

/*!
    \brief      get TIMER flags
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  flag: the TIMER flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare flag, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_BRK0: BREAK0 flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_BRK1: BREAK1 flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_SYSB: system source break flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_IND: index flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_DIRTRAN: direction transform flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_INDERR: index error flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_MCH1: multi mode channel 1 capture or compare flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH2: multi mode channel 2 capture or compare flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH3: multi mode channel 3 capture or compare flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH0O: multi mode channel 0 overcapture flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_MCH1O: multi mode channel 1 overcapture flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH2O: multi mode channel 2 overcapture flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH3O: multi mode channel 3 overcapture flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare flag, TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    FlagStatus timer_flag = RESET;
    if(RESET != (TIMER_INTF(timer_periph) & flag)) {
        timer_flag = SET;
    } else {
        timer_flag = RESET;
    }
    return timer_flag;
}

/*!
    \brief      clear TIMER flags
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  flag: the TIMER flags
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_FLAG_UP: update flag, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_FLAG_CH0: channel 0 capture or compare flag, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_FLAG_CH1: channel 1 capture or compare flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH2: channel 2 capture or compare flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CH3: channel 3 capture or compare flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CMT: channel commutation flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_TRG: trigger flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_BRK0: BREAK0 flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_BRK1: BREAK1 flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_SYSB: system source break flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_IND: index flag, (x=0~4,7,19)
      \arg        TIMER_FLAG_DECJ: quadrature decoder signal jump flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_DECDIS: quadrature decoder signal disconnection flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_DIRTRAN: direction transform flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_INDERR: index error flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_MCH0: multi mode channel 0 capture or compare flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_MCH1: multi mode channel 1 capture or compare flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH2: multi mode channel 2 capture or compare flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH3: multi mode channel 3 capture or compare flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH0O: multi mode channel 0 overcapture flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_FLAG_MCH1O: multi mode channel 1 overcapture flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH2O: multi mode channel 2 overcapture flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_MCH3O: multi mode channel 3 overcapture flag, TIMERx(x=0,7,19)
      \arg        TIMER_FLAG_CH0COMADD: channel 0 additional compare flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH1COMADD: channel 1 additional compare flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_FLAG_CH2COMADD: channel 2 additional compare flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_FLAG_CH3COMADD: channel 3 additional compare flag, TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)flag);
}

/*!
    \brief      enable the TIMER interrupt
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  interrupt: timer interrupt source
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_INT_UP: update interrupt, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_INT_CH0: channel 0 capture or compare interrupt, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_INT_CH1: channel 1 capture or compareinterrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_CH2: channel 2 capture or compare interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_CH3: channel 3 capture or compare interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_CMT: channel commutation interrupt, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_TRG: trigger interrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_BRK: break interrupt, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_IND: index interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_DECJ: quadrature decoder signal jump interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_DECDIS: quadrature decoder signal disconnection interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_DIRTRAN: direction transform interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_INDERR: index error interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_MCH0: multi mode channel 0 capture or compare interrupt, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_MCH1: multi mode channel 1 capture or compare interrupt, TIMERx(x=0,7,19)
      \arg        TIMER_INT_MCH2: multi mode channel 2 capture or compare interrupt, TIMERx(x=0,7,19)
      \arg        TIMER_INT_MCH3: multi mode channel 3 capture or compare interrupt, TIMERx(x=0,7,19)
      \arg        TIMER_INT_CH0COMADD: channel 0 additional compare interrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_CH1COMADD: channel 1 additional compare interrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_CH2COMADD: channel 2 additional compare interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_CH3COMADD: channel 3 additional compare interrupt, TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     none
*/
void timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t) interrupt;
}

/*!
    \brief      disable the TIMER interrupt
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  interrupt: timer interrupt source
                one or more parameters can be selected which are shown as below:
      \arg        TIMER_INT_UP: update interrupt, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_INT_CH0: channel 0 capture or compare interrupt, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_INT_CH1: channel 1 capture or compareinterrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_CH2: channel 2 capture or compare interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_CH3: channel 3 capture or compare interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_CMT: channel commutation interrupt, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_TRG: trigger interrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_BRK: break interrupt, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_IND: index interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_DECJ: quadrature decoder signal jump interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_DECDIS: quadrature decoder signal disconnection interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_DIRTRAN: direction transform interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_INDERR: index error interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_MCH0: multi mode channel 0 capture or compare interrupt, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_MCH1: multi mode channel 1 capture or compare interrupt, TIMERx(x=0,7,19)
      \arg        TIMER_INT_MCH2: multi mode channel 2 capture or compare interrupt, TIMERx(x=0,7,19)
      \arg        TIMER_INT_MCH3: multi mode channel 3 capture or compare interrupt, TIMERx(x=0,7,19)
      \arg        TIMER_INT_CH0COMADD: channel 0 additional compare interrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_CH1COMADD: channel 1 additional compare interrupt, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_CH2COMADD: channel 2 additional compare interrupt, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_CH3COMADD: channel 3 additional compare interrupt, TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     none
*/
void timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)interrupt);
}

/*!
    \brief      get timer interrupt flags
    \param[in]  timer_periph: TIMERx(x=0~7,14~16,19)
    \param[in]  int_flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag, TIMERx(x=0~7,14~16,19)
      \arg        TIMER_INT_FLAG_CH0: channel 0 capture or compare interrupt flag, TIMERx(x=0~4,7,14~16,19)
      \arg        TIMER_INT_FLAG_CH1: channel 1 capture or compare interrupt flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_FLAG_CH2: channel 2 capture or compare interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_CH3: channel 3 capture or compare interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_FLAG_BRK0: BREAK0 interrupt flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_FLAG_BRK1: BREAK1 interrupt flag, TIMERx(x=0,7,19)
      \arg        TIMER_INT_FLAG_SYSB: system source break interrupt flag, TIMERx(x=0,7,19)
      \arg        TIMER_INT_FLAG_IND: index interrupt flag, TIMERx((x=0~4,7,19)
      \arg        TIMER_INT_FLAG_DECJ: quadrature decoder signal jump interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_DECDIS: quadrature decoder signal disconnection interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_DIRTRAN: direction transform interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_INDERR: index error interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_MCH0: multi mode channel 0 capture or compare interrupt flag, TIMERx(x=0,7,14~16,19)
      \arg        TIMER_INT_FLAG_MCH1: multi mode channel 1 capture or compare interrupt flag, TIMERx(x=0,7,19)
      \arg        TIMER_INT_FLAG_MCH2: multi mode channel 2 capture or compare interrupt flag, TIMERx(x=0,7,19)
      \arg        TIMER_INT_FLAG_MCH3: multi mode channel 3 capture or compare interrupt flag, TIMERx(x=0,7,19)
      \arg        TIMER_INT_FLAG_CH0COMADD: channel 0 additional compare interrupt flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_FLAG_CH1COMADD: channel 1 additional compare interrupt flag, TIMERx(x=0~4,7,14,19)
      \arg        TIMER_INT_FLAG_CH2COMADD: channel 2 additional compare interrupt flag, TIMERx(x=0~4,7,19)
      \arg        TIMER_INT_FLAG_CH3COMADD: channel 3 additional compare interrupt flag, TIMERx(x=0~4,7,19)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    FlagStatus timer_interrupt_flag = RESET;
    uint32_t val;

    if(TIMER_INT_FLAG_BRK1 == int_flag) {
        val = (TIMER_DMAINTEN(timer_periph) & TIMER_DMAINTEN_BRKIE);
    } else if(TIMER_INT_FLAG_SYSB == int_flag) {
        val = (TIMER_DMAINTEN(timer_periph) & TIMER_DMAINTEN_BRKIE);
    } else {
        val = (TIMER_DMAINTEN(timer_periph) & int_flag);
    }

    if((RESET != (TIMER_INTF(timer_periph) & int_flag)) && (RESET != val)) {
        timer_interrupt_flag = SET;
    } else {
        timer_interrupt_flag = RESET;
    }
    return timer_interrupt_flag;
}

